tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"
tap "homebrew/core"
tap "homebrew/fuse"
#tap "universal-ctags/universal-ctags"
tap "buo/cask-upgrade"

# System
brew "mas"
brew "htop"
brew "coreutils"
brew "ssh-copy-id"
brew "mackup"
cask "osxfuse"
cask "hammerspoon"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-mono"
cask "font-roboto"
cask "font-roboto-condensed"
cask "coconutbattery"

# Email
#brew "neomutt/homebrew-neomutt/neomutt", args: ["with-notmuch-patch", "with-gpgme", "HEAD"]
brew "isync"
brew "msmtp"
brew "notmuch"
brew "ripmime"
brew "mu"

# Web
brew "w3m"

# Java
cask "java"

# Python
#brew "python"
#brew "python@2"

# Network
cask "tripmode"
cask "wireshark"
#cask "transmit"
#cask "forklift"
#cask "tunnelblick"
cask "viscosity"
cask "secure-pipes"
cask "gas-mask"
cask "charles"
brew "curl", args: ["with-openssl"]
cask "paw"
brew "wget"
brew "httpie"
brew "mitmproxy"
brew "nmap"
brew "openssl"
brew "aria2"

# File system
brew "fd"
brew "ranger"
cask "arq"
cask "the-unarchiver"
cask "daisydisk"
cask "dropbox"
#cask "arq"
brew "peco"
brew "fpp"
brew "fasd"
brew "direnv"
brew "fzf"
brew "ack"
brew "the_silver_searcher"
brew "ripgrep"

cask "basictex"

# Docker
brew "hadolint"
#cask "docker-toolbox"

# Vim/Neovim
brew "neovim"
brew "vim", args: ["with-python3", "with-gettext","with-lua"]

# Terminal
brew "zsh"
brew "tldr"
brew "rlwrap"
brew "reattach-to-user-namespace"
cask "marathono"

# Design
cask "adobe-creative-cloud"
cask "monodraw"
cask "sip"

# Security
mas "1Password", id: 443987910
cask "1password-cli"
cask "santa"
cask "lockdown"
brew "dnsmasq", args: ["with-dnssec"]
brew "dnscrypt-proxy"
brew "privoxy", restart_service: :changed
#cask "private-internet-access"
cask "little-snitch"
cask "oversight"
brew "gpg"
cask "gpg-suite"

# Development
brew "jq"
mas "Xcode", id: 497799835
cask "virtualbox"
cask "vagrant"
cask "sourcetree"
cask "sublime-text"
cask "kaleidoscope"
cask "iterm2-nightly"
cask "intellij-idea-ce"
cask "dash"
brew "valgrind"
brew "yarn", arsg: ["without-node"]
brew "git"
brew "tig"
brew "mercurial"
brew "darcs"
brew "shellcheck"
#brew "ctags", args: ["HEAD universal-ctags/universal-ctags/universal-ctags"]
brew "doctl"

# Clojure
brew "leiningen"

# HTML
brew "tidy-html5"

# Web
mas "Helium", id: 1054607607
cask "slack-beta"
cask "skype"
cask "mailmate"
brew "weechat", args: ["with-aspell", "with-lua", "with-perl", "with-python", "with-ruby"]
#cask "franz"
cask "vivaldi"
cask "firefox"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "google-chrome"
brew "newsboat"

# tmux
brew "tmux", args: ["with-utf8proc"]

# Media
mas "Simplify", id: 448003584
#mas "Noizio", id: 928871589
cask "spotify"
cask "plug"
brew "imagemagick"
brew "pngcrush"
brew "youtube-dl"
brew "ffmpeg"
cask "iina"
cask "vlc"
mas "Radium", id: 597611879

# Utils
mas "PopClip", id: 445189367
mas "Amphetamine", id: 937984704
cask "nosleep"
#cask "textexpander"
cask "spectacle"
#cask "hazel"
cask "cleanmymac"
#cask "commandq"
cask "alfred"
cask "bartender"
cask "endurance"
#cask "dterm"
mas "Soulver", id: 413965349
mas "Characters", id: 536511979
mas "Clocker", id: 1056643111

# Apple
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "Pages", id: 409201541
mas "GarageBand", id: 682658836

# Other
cask "itsycal"
mas "Day One", id: 1055511498
mas "Todoist", id: 585829637
brew "proselint"
cask "imazing"
cask "macdown"
cask "kindle"
cask "Leaf", id: 576338668
cask "adobe-acrobat-reader"
