tap "borkdude/brew"
tap "candid82/brew"
tap "d12frosted/emacs-plus"
tap "federico-terzi/espanso"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jimeh/emacs-builds"
tap "uptech/oss"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "readline"
brew "asdf"
brew "atuin"
brew "xz"
brew "awscli"
brew "bat"
brew "blueutil"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "cask"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "difftastic"
brew "direnv"
brew "doctl"
brew "wxwidgets"
brew "exa"
brew "fd"
brew "fennel"
brew "gobject-introspection"
brew "ffmpeg"
brew "fish"
brew "fnlfmt"
brew "fop"
brew "fzf"
brew "fzy"
brew "gcc"
brew "gh"
brew "ghq"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "glow"
brew "pinentry"
brew "gnupg"
brew "swift-protobuf"
brew "grpc-swift"
brew "grpcurl"
brew "helix", args: ["HEAD"]
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "just"
brew "kakoune"
brew "kubernetes-cli"
brew "languagetool"
brew "leiningen"
brew "libgccjit"
brew "libpq", link: true
brew "pango"
brew "lima"
brew "llvm"
brew "mas"
brew "neovim"
brew "newsboat"
brew "ninja"
brew "nmap"
brew "peco"
brew "php"
brew "pinentry-mac"
brew "podman"
brew "postgresql@12", restart_service: true
brew "proselint"
brew "ranger"
brew "reattach-to-user-namespace"
brew "rebar3"
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "sd"
brew "shellcheck"
brew "shellharden"
brew "shfmt"
brew "ssh-copy-id"
brew "stylua"
brew "subversion"
brew "swiftformat"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxp"
brew "ugit"
brew "vale"
brew "wakeonlan"
brew "weechat"
brew "wget"
brew "wimlib"
brew "youtube-dl"
brew "zbar"
brew "zola"
brew "zoxide"
brew "zsh"
brew "borkdude/brew/babashka"
brew "candid82/brew/joker"
brew "federico-terzi/espanso/espanso"
brew "jesseduffield/lazygit/lazygit"
brew "uptech/oss/alt"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "bartender"
cask "beamer"
cask "calibre"
cask "cleanshot"
cask "cursorsense"
cask "daisydisk"
cask "dash"
cask "discord"
cask "element"
cask "emacs-app"
cask "figma"
cask "firefox"
cask "firefox-nightly"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-karla"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "imazing"
cask "karabiner-elements"
cask "keka"
cask "kindle"
cask "kitty"
cask "mailmate"
cask "meetingbar"
cask "monitorcontrol"
cask "monodraw"
cask "mullvadvpn"
cask "notion"
cask "optimus-player"
cask "paparazzi"
cask "parallels"
cask "paw"
cask "porting-kit"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "replacicon"
cask "sabnzbd"
cask "sensei"
cask "slack"
cask "soundsource"
cask "spotify"
cask "steam"
cask "tableplus"
cask "tex-live-utility"
cask "texpad"
cask "tor-browser"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zoom"
mas "CotEditor", id: 1024640650
mas "Daisy", id: 1592128332
mas "GarageBand", id: 682658836
mas "HazeOver", id: 430798174
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "Minimalist", id: 1523397704
mas "Numbers", id: 409203825
mas "OpenIn", id: 1547147101
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Pins", id: 1547106997
mas "Pixelmator Pro", id: 1289583905
mas "Plug", id: 1514182074
mas "PopClip", id: 445189367
mas "Prime Video", id: 545519333
mas "ShellHistory", id: 1564015476
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Textual IRC Client", id: 1262957439
mas "Things", id: 904280696
mas "Tomato 2", id: 1494210770
mas "ToothFairy", id: 1191449274
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 1147396723
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
